Repository: mimson1337/InzApp
Catalog: Application/locale/*/LC_MESSAGES/django.po
Languages: pl

source: Django App
pl: Aplikacja Django

source: My Django App
pl: Moja Apka Django

source: Home
pl: Strona główna

source: Search
pl: Wyszukaj

source: The Depression Speech Analysis App
pl: Aplikacja do analizy mowy w depresji

source: The goal of developing an application for searching speech recordings of people with depression based on specified keywords is to support research on depression by analyzing linguistic patterns in speech. Automating this process allows for quick data retrieval, making it easier for researchers and therapists to access relevant materials, which can help in understanding depression mechanisms and monitoring patient conditions.
pl: Celem opracowania aplikacji do wyszukiwania nagrań mowy osób z depresją na podstawie określonych słów kluczowych jest wsparcie badań nad depresją poprzez analizę wzorców językowych w mowie. Automatyzacja tego procesu umożliwia szybkie pozyskiwanie danych, co ułatwia badaczom i terapeutom dostęp do odpowiednich materiałów, mogących pomóc w zrozumieniu mechanizmów depresji oraz monitorowaniu stanu pacjentów.

source: Search Recordings
pl: Wyszukiwanie nagrań

source: Enter the URL of the website where recordings are hosted, or upload local MP3/WAV files to transcribe them.
pl: Wprowadź adres URL strony, na której znajdują się nagrania, lub przesyłaj lokalne pliki MP3/WAV, aby je przeszukać.

source: Choose input method:
pl: Wybierz metodę wejścia:

source: Enter URL
pl: Wprowadź adres URL

source: Upload local MP3/WAV files
pl: Prześlij lokalne pliki MP3/WAV

source: URL
pl: Adres URL

source: Enter Keywords to Search:
pl: Wprowadź słowa kluczowe do wyszukiwania:

source: Enter keywords separated by *and*
pl: Wprowadź słowa kluczowe oddzielone przez *and*

source: Or select from predefined keywords:
pl: Lub wybierz z predefiniowanych słów kluczowych:

source: Depressed
pl: Przygnębiony

source: Depression
pl: Depresja

source: Anxiety
pl: Lęk

source: Always Tired
pl: Zawsze zmęczony

source: Suicide
pl: Samobójstwo

source: Upload MP3/WAV files:
pl: Prześlij pliki MP3/WAV:

source: Transcribe Selected
pl: Przeszukaj zaznaczone

source: No MP3 files found.
pl: Nie znaleziono plików MP3.

source: An error occurred. Please try again.
pl: Wystąpił błąd. Proszę spróbować ponownie.

source: Please select at least one MP3 to transcribe.
pl: Proszę wybrać przynajmniej jeden plik MP3 do transkrypcji.

source: Transcription:
pl: Transkrypcja:

source: Keywords Found:
pl: Znalezione słowa kluczowe:
